{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 100,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 100
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "{": 5,
      "}": 6,
      "\\": 7,
      "{\\": 8,
      "1": 9,
      "2": 10,
      "_": 11,
      "(": 12,
      "^{": 13,
      "x": 14,
      "n": 15,
      "0": 16,
      "}}": 17,
      "frac": 18,
      "}\\": 19,
      ",": 20,
      "operatorname": 21,
      "i": 22,
      "a": 23,
      "}{": 24,
      ")}": 25,
      "in": 26,
      "+": 27,
      "=": 28,
      "-": 29,
      "mathbb": 30,
      "{{\\": 31,
      "}}}": 32,
      "f": 33,
      "3": 34,
      "k": 35,
      ")\\": 36,
      "}}\\": 37,
      "mathbf": 38,
      "left": 39,
      "right": 40,
      "b": 41,
      "A": 42,
      "&": 43,
      "R": 44,
      "to": 45,
      "}(": 46,
      "x_": 47,
      "y": 48,
      "d": 49,
      "}^{": 50,
      "X": 51,
      "colon": 52,
      "mathrm": 53,
      "p": 54,
      "(\\": 55,
      "m": 56,
      "}{\\": 57,
      "M": 58,
      "t": 59,
      "mathcal": 60,
      "a_": 61,
      "B": 62,
      "c": 63,
      "C": 64,
      "}+": 65,
      "g": 66,
      "4": 67,
      "infty": 68,
      "r": 69,
      "K": 70,
      ",\\": 71,
      "begin": 72,
      "end": 73,
      "S": 74,
      "z": 75,
      "times": 76,
      "pi": 77,
      "sqrt": 78,
      "{(": 79,
      "^{\\": 80,
      "=\\": 81,
      "}=": 82,
      "int": 83,
      "sum": 84,
      "partial": 85,
      "V": 86,
      "alpha": 87,
      "e": 88,
      "P": 89,
      "E": 90,
      "j": 91,
      "T": 92,
      "v": 93,
      "s": 94,
      "cdot": 95,
      "G": 96,
      "N": 97,
      "mathfrak": 98,
      "phi": 99,
      "mu": 100,
      "over": 101,
      "cdots": 102,
      "F": 103,
      "},\\": 104,
      "/": 105,
      "}-": 106,
      "},": 107,
      "H": 108,
      "leq": 109,
      "sin": 110,
      ")^{": 111,
      "\\\\": 112,
      "}}{": 113,
      ")=": 114,
      "q": 115,
      "cos": 116,
      "}^{\\": 117,
      "={\\": 118,
      "({\\": 119,
      "qquad": 120,
      "^{-": 121,
      "pmatrix": 122,
      "subseteq": 123,
      "}}(": 124,
      "5": 125,
      ".": 126,
      "lambda": 127,
      "dots": 128,
      "theta": 129,
      "})}": 130,
      "L": 131,
      "u": 132,
      "sigma": 133,
      ")=\\": 134,
      ")": 135,
      "I": 136,
      "h": 137,
      "beta": 138,
      "}=\\": 139,
      "\\}}": 140,
      "Z": 141,
      "U": 142,
      "D": 143,
      "\\,": 144,
      "text": 145,
      "Q": 146,
      "[": 147,
      "delta": 148,
      "\\{": 149,
      "}}{\\": 150,
      "Y": 151,
      "rangle": 152,
      "Gamma": 153,
      "}}}\\": 154,
      "+\\": 155,
      "bullet": 156,
      "forall": 157,
      "}(\\": 158,
      "dx": 159,
      "b_": 160,
      "|": 161,
      "A_": 162,
      "Delta": 163,
      "-\\": 164,
      "otimes": 165,
      "omega": 166,
      "aligned": 167,
      "}={\\": 168,
      "gamma": 169,
      "}}}}": 170,
      "langle": 171,
      "ax": 172,
      "}+\\": 173,
      "circ": 174,
      "})\\": 175,
      "psi": 176,
      "6": 177,
      "mapsto": 178,
      "epsilon": 179,
      "y_": 180,
      "rho": 181,
      "}}={\\": 182,
      "nu": 183,
      ";\\": 184,
      "t_": 185,
      "}}^{": 186,
      "mathsf": 187,
      "Omega": 188,
      "}&": 189,
      "ln": 190,
      ";": 191,
      "neq": 192,
      "f_": 193,
      "10": 194,
      "n_": 195,
      "&\\": 196,
      "vec": 197,
      "lim": 198,
      "bar": 199,
      "p_": 200,
      "nabla": 201,
      "setminus": 202,
      "E_": 203,
      "matrix": 204,
      "w": 205,
      "geq": 206,
      "+{\\": 207,
      "X_": 208,
      "|\\": 209,
      "}}=": 210,
      "V_": 211,
      "cases": 212,
      "<": 213,
      "W": 214,
      "dotsc": 215,
      "hat": 216,
      "T_": 217,
      "2n": 218,
      "textstyle": 219,
      "M_": 220,
      "v_": 221,
      "bmatrix": 222,
      "J": 223,
      "g_": 224,
      "tilde": 225,
      "ij": 226,
      "B_": 227,
      "dot": 228,
      "8": 229,
      "r_": 230,
      "cap": 231,
      "7": 232,
      "oplus": 233,
      ")(": 234,
      "Sigma": 235,
      "cong": 236,
      "U_": 237,
      "{(\\": 238,
      "]}": 239,
      "C_": 240,
      "k_": 241,
      ")={\\": 242,
      "})": 243,
      "\\\\\\": 244,
      "}}+{\\": 245,
      "{|": 246,
      ")}{": 247,
      "mbox": 248,
      "F_": 249,
      "exp": 250,
      "c_": 251,
      "pm": 252,
      "uparrow": 253,
      "'\\": 254,
      ">": 255,
      "color": 256,
      "O": 257,
      ")+": 258,
      "d_": 259,
      "-{\\": 260,
      "tau": 261,
      "}})}": 262,
      "{-": 263,
      "Vert": 264,
      "z_": 265,
      "}}=\\": 266,
      "h_": 267,
      "S_": 268,
      "]\\": 269,
      "l": 270,
      "quad": 271,
      "P_": 272,
      "{{": 273,
      "&-": 274,
      ")-": 275,
      "\\}\\": 276,
      "12": 277,
      "{\\{": 278,
      "m_": 279,
      "downarrow": 280,
      "cup": 281,
      "scriptstyle": 282,
      "u_": 283,
      "prod": 284,
      "i_": 285,
      "{[": 286,
      "cl": 287,
      "}-\\": 288,
      "vmatrix": 289,
      ",{\\": 290,
      "vdots": 291,
      "9": 292,
      "'}": 293,
      "R_": 294,
      "}&\\": 295,
      "hbar": 296,
      "dt": 297,
      "}/": 298,
      "))}": 299,
      "I_": 300,
      "cosh": 301,
      "})^{": 302,
      "q_": 303,
      "textbf": 304,
      "^{(": 305,
      "sim": 306,
      "}}(\\": 307,
      "N_": 308,
      "log": 309,
      "equiv": 310,
      "}\\\\": 311,
      "H_": 312,
      "&{\\": 313,
      "e_": 314,
      ")}}": 315,
      "'": 316,
      "11": 317,
      "array": 318,
      "}}+": 319,
      "}}^{\\": 320,
      "dim": 321,
      "kappa": 322,
      "det": 323,
      "s_": 324,
      "}|": 325,
      "boldsymbol": 326,
      "angle": 327,
      "ab": 328,
      "tan": 329,
      "\\{\\": 330,
      "overrightarrow": 331,
      "sinh": 332,
      "ldots": 333,
      "Q_": 334,
      "'(": 335,
      "<\\": 336,
      "varnothing": 337,
      "xi": 338,
      "Spec": 339,
      "hom": 340,
      "approx": 341,
      "bigcup": 342,
      "exists": 343,
      "o": 344,
      "&&\\": 345,
      ",\\;": 346,
      "}},{\\": 347,
      "dotsb": 348,
      "iota": 349,
      "G_": 350,
      "iff": 351,
      "L_": 352,
      "deg": 353,
      "tfrac": 354,
      "vee": 355,
      "})=": 356,
      "ell": 357,
      "j_": 358,
      "}}-{\\": 359,
      "Mat": 360,
      "sup": 361,
      "}+{\\": 362,
      ")^{\\": 363,
      ")}\\": 364,
      "}}}={\\": 365,
      "varepsilon": 366,
      "varphi": 367,
      "}})\\": 368,
      "chi": 369,
      "wedge": 370,
      "=(": 371,
      "}-{\\": 372,
      "rm": 373,
      ")+\\": 374,
      "/\\": 375,
      "land": 376,
      "ì": 377,
      "[\\": 378,
      "}}}{\\": 379,
      "K_": 380,
      "}\\\\\\": 381,
      ")}{\\": 382,
      "2x": 383,
      "[{\\": 384,
      "}^{(": 385,
      "mid": 386,
      "}\\}}": 387,
      "}}&": 388,
      "max": 389,
      "){\\": 390,
      "implies": 391,
      ")/": 392,
      ")\\,": 393,
      ")}(": 394,
      "xrightarrow": 395,
      "}\\,": 396,
      "{{{": 397,
      ")-\\": 398,
      "(-": 399,
      "\\,\\": 400,
      "lfloor": 401,
      ".}": 402,
      "rfloor": 403,
      "subset": 404,
      "|{\\": 405,
      "=\\{": 406,
      "{}": 407,
      "|}": 408,
      "overset": 409,
      "1_": 410,
      "}},\\": 411,
      "^{*}": 412,
      "not": 413,
      "Pr": 414,
      "dagger": 415,
      "red": 416,
      "))\\": 417,
      ")}}\\": 418,
      "J_": 419,
      "min": 420,
      "=-": 421,
      "21": 422,
      "\\;": 423,
      "[{": 424,
      "w_": 425,
      "Phi": 426,
      "rightarrow": 427,
      "aleph": 428,
      "}}}=": 429,
      "}({\\": 430,
      "}}}+{\\": 431,
      "lor": 432,
      "{-\\": 433,
      "eta": 434,
      "hookrightarrow": 435,
      "})=\\": 436,
      "',": 437,
      "top": 438,
      "pmod": 439,
      "}}+\\": 440,
      "^{*}\\": 441,
      "4a": 442,
      "AB": 443,
      "]": 444,
      "}=(": 445,
      "ë": 446,
      ")}}}": 447,
      "2a": 448,
      "Sym": 449,
      "13": 450,
      "tr": 451,
      "),": 452,
      "}|\\": 453,
      "cot": 454,
      "id": 455,
      "underbrace": 456,
      "zeta": 457,
      "}}}}}": 458,
      "W_": 459,
      "bigwedge": 460,
      "ord": 461,
      "bigoplus": 462,
      "16": 463,
      "2m": 464,
      "}}-": 465,
      ")=(": 466,
      "lnot": 467,
      "op": 468,
      "}+{": 469,
      ":": 470,
      "bx": 471,
      "lesssim": 472,
      "2k": 473,
      "\\|": 474,
      "ker": 475,
      "Lambda": 476,
      "twoheadrightarrow": 477,
      "}]}": 478,
      "binom": 479,
      "}}}{": 480,
      "dfrac": 481,
      "}{(": 482,
      "),\\": 483,
      "{({\\": 484,
      "GL": 485,
      "vert": 486,
      "),(": 487,
      "D_": 488,
      "upharpoonright": 489,
      "}^{-": 490,
      "}=-": 491,
      "22": 492,
      "\\\\-": 493,
      "}+(": 494,
      "{\\{\\": 495,
      "AC": 496,
      "bigcap": 497,
      "gcd": 498,
      "sqcup": 499,
      "={": 500,
      "underset": 501,
      ")=\\{": 502,
      "|^{": 503,
      "dom": 504,
      "if": 505,
      "xy": 506,
      "White": 507,
      "SO": 508,
      "ce": 509,
      "{|\\": 510,
      "}}({\\": 511,
      "}]{": 512,
      "}})^{": 513,
      "}},": 514,
      "2c": 515,
      "=-{\\": 516,
      "Y_": 517,
      ",-": 518,
      "ddots": 519,
      "}}&{\\": 520,
      "((": 521,
      "Pi": 522,
      "Span": 523,
      "}}}}\\": 524,
      ")^{-": 525,
      "=-\\": 526,
      "\\,}": 527,
      "(-\\": 528,
      "cfrac": 529,
      "triangle": 530,
      "({": 531,
      "23": 532,
      "dy": 533,
      "}}\\,": 534,
      "0_": 535,
      "15": 536,
      "Psi": 537,
      "+(": 538,
      "Rightarrow": 539,
      "SU": 540,
      "}={": 541,
      "}}{(": 542,
      "Mod": 543,
      "/{\\": 544,
      ".{\\": 545,
      "mn": 546,
      "},{\\": 547,
      "\\;\\": 548,
      "}<": 549,
      "&=": 550,
      "({{": 551,
      "2p": 552,
      "for": 553,
      ")+{\\": 554,
      "perp": 555,
      "}.}": 556,
      "24": 557,
      "atop": 558,
      "})(": 559,
      "')}": 560,
      ")\\}}": 561,
      "})}{": 562,
      "}\\}": 563,
      "}}-\\": 564,
      "BC": 565,
      "Cyc": 566,
      "\\})}": 567,
      "}[": 568,
      "]=": 569,
      "underline": 570,
      "14": 571,
      "Z_": 572,
      "ad": 573,
      "|=": 574,
      ";{\\": 575,
      "bc": 576,
      "rad": 577,
      "supseteq": 578,
      "{(-": 579,
      "}\\}\\": 580,
      "Cliff": 581,
      ")(\\": 582,
      "^{*}}": 583,
      "rceil": 584,
      "subsetneq": 585,
      "lceil": 586,
      "vdash": 587,
      "}|^{": 588,
      "^{+}}": 589,
      "ball": 590,
      "sgn": 591,
      "^{+}\\": 592,
      "\\\\{\\": 593,
      "}}}=\\": 594,
      "^{*}(": 595,
      "dr": 596,
      "|<\\": 597,
      ")|\\": 598,
      "End": 599
    },
    "unk_token": "[UNK]"
  }
}