{"version":"1.0","truncation":{"max_length":100,"strategy":"LongestFirst","stride":0},"padding":{"strategy":{"Fixed":100},"direction":"Right","pad_to_multiple_of":null,"pad_id":0,"pad_type_id":0,"pad_token":"[PAD]"},"added_tokens":[{"id":0,"special":true,"content":"[UNK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"[CLS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"[SEP]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":4,"special":true,"content":"[MASK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"Whitespace"},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"[CLS]","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"[SEP]","type_id":0}}],"pair":[{"SpecialToken":{"id":"[CLS]","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"[SEP]","type_id":0}},{"Sequence":{"id":"B","type_id":1}},{"SpecialToken":{"id":"[SEP]","type_id":1}}],"special_tokens":{"[CLS]":{"id":"[CLS]","ids":[1],"tokens":["[CLS]"]},"[SEP]":{"id":"[SEP]","ids":[2],"tokens":["[SEP]"]}}},"decoder":null,"model":{"type":"BPE","dropout":null,"unk_token":"[UNK]","continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"[UNK]":0,"[CLS]":1,"[SEP]":2,"[PAD]":3,"[MASK]":4,"!":5,"&":6,"'":7,"(":8,")":9,"*":10,"+":11,",":12,"-":13,".":14,"/":15,"0":16,"1":17,"2":18,"3":19,"4":20,"5":21,"6":22,"7":23,"8":24,"9":25,";":26,"<":27,"=":28,">":29,"A":30,"B":31,"C":32,"D":33,"E":34,"F":35,"G":36,"H":37,"I":38,"J":39,"K":40,"L":41,"M":42,"N":43,"O":44,"P":45,"R":46,"S":47,"T":48,"U":49,"V":50,"W":51,"X":52,"Y":53,"[":54,"\\":55,"]":56,"^":57,"_":58,"a":59,"b":60,"c":61,"d":62,"e":63,"f":64,"g":65,"h":66,"i":67,"j":68,"k":69,"l":70,"m":71,"n":72,"o":73,"p":74,"q":75,"r":76,"s":77,"t":78,"u":79,"v":80,"w":81,"x":82,"y":83,"z":84,"{":85,"|":86,"}":87,"{\\":88,"at":89,"}}":90,"me":91,"mat":92,"math":93,"er":94,"}\\":95,"or":96,"na":97,"^{":98,"op":99,"ator":100,"erator":101,"name":102,"operator":103,"operatorname":104,"al":105,"et":106,"ra":107,"ig":108,"in":109,"fra":110,"rm":111,"mathrm":112,"ph":113,"mu":114,"eta":115,"le":116,"ga":117,"beta":118,"mega":119,")\\":120,"pha":121,"alpha":122,"(\\":123,"=\\":124,"^{\\":125,"ma":126,"mathfra":127,"mathfrak":128,"{{":129,"nu":130,"rt":131,"ot":132,",\\":133,"}}\\":134,"-\\":135,"ht":136,"rig":137,"right":138,"ft":139,"omega":140,"mathb":141,"left":142,"Ri":143,"la":144,"on":145,"dot":146,"}^{":147,"ex":148,"ge":149,"frac":150,"+\\":151,"ad":152,"ed":153,"em":154,"ij":155,"Riem":156,"igma":157,"dots":158,"su":159,"wed":160,"x_":161,"}{":162,"wedge":163,"}(":164,";\\":165,"to":166,"tr":167,"}=":168,"mathbb":169,"co":170,"lon":171,"qrt":172,"sqrt":173,"},":174,"exp":175,"colon":176,"ime":177,"J_":178,"bla":179,"ho":180,"rho":181,"nabla":182,"imes":183,"pa":184,"sigma":185,"}]":186,"ps":187,"set":188,"bset":189,"ial":190,"rc":191,"ta":192,"rtial":193,"subset":194,"partial":195,"M_":196,"pi":197,"qu":198,"times":199,"}=\\":200,"}}(":201,"quad":202,"F_":203,"Omega":204,"ov":205,"qquad":206,"}^{\\":207,"phi":208,"over":209,"(-\\":210,")=":211,"de":212,"lrc":213,"ner":214,"}-":215,"}}^{":216,"orner":217,"lrcorner":218,")=\\":219,"*}":220,"P_":221,"am":222,"}{\\":223,"({{":224,"big":225,"}+":226,"},\\":227,"}-\\":228,"}]=":229,"AB":230,"Or":231,"lta":232,"us":233,"delta":234,"Ord":235,")^{":236,"OE":237,"for":238,"gle":239,"lus":240,"ngle":241,"}+\\":242,"oplus":243,"mathbf":244,"psi":245,"bigwedge":246,"U_":247,"\\}":248,"g_":249,"{{\\":250,"}}=":251,"}}}\\":252,"all":253,"forall":254,"..":255,"C_":256,"N_":257,"i_":258,"ln":259,"})":260,"maps":261,"}^{*}":262,"sum":263,"mapsto":264,"10":265,"B_":266,"Gam":267,"Sigma":268,"[\\":269,"\\{\\":270,"cl":271,"con":272,"il":273,"ri":274,"tH":275,"th":276,"})\\":277,"Gamma":278,"({\\":279,"={\\":280,"AO":281,"CE":282,"Ham":283,"\\{":284,"ab":285,"bd":286,"bmat":287,"cu":288,"cal":289,"e_":290,"st":291,"}&":292,"}}}":293,"mathcal":294,"leq":295,"dotsi":296,"cong":297,"rix":298,"theta":299,"bmatrix":300,"cup":301,",[":302,"2n":303,";=":304,"E_":305,"IS":306,"T_":307,"\\;\\":308,"ac":309,"cdots":310,"ik":311,"jk":312,"jl":313,"ll":314,"nd":315,"tex":316,"tst":317,"yle":318,"}/":319,"}}{":320,"^{*}":321,"rangle":322,"langle":323,";\\;=":324,"tau":325,"}]=[":326,"\\;\\;\\;=":327,"tstyle":328,"(-":329,")(":330,")-":331,")}}":332,"12":333,"<\\":334,"EB":335,"PV":336,"W_":337,"ar":338,"be":339,"bu":340,"di":341,"end":342,"gin":343,"ia":344,"ii":345,"iot":346,"jj":347,"mbd":348,"r_":349,"sl":350,"t_":351,"v_":352,"{(":353,"}}'":354,"}}^{\\":355,"}\\\\":356,",\\;\\":357,"lambd":358,"dotsb":359,"}{}":360,"}={\\":361,"}={{":362,"}-{{":363,"llet":364,"textstyle":365,"begin":366,"bullet":367,"iota":368,"lambda":369,"&=\\":370,"''":371,"',":372,"([":373,")+":374,"*}\\":375,"-{\\":376,"08":377,"AE":378,"L_":379,"Mat":380,"OC":381,"XY":382,"X_":383,"\\,":384,"]=":385,"]\\":386,"ai":387,"bin":388,"bar":389,"c_":390,"ch":391,"cdot":392,"f_":393,"gl":394,"gal":395,"li":396,"not":397,"om":398,"{|":399,"otimes":400,",\\;":401,"Ric":402,"geq":403,"ijk":404,"dotsc":405,"}{}^{":406,"deg":407,"}}={{":408,"ISO":409,"binom":410,"chi":411,")|":412,")}":413,")^{\\":414,")}(":415,")}=":416,")}{\\":417,"+[":418,"+}":419,"+)\\":420,"+{{":421,",+)\\":422,"15":423,"27":424,"59":425,"=(":426,"=-\\":427,"={{\\":428,"Au":429,"A08":430,"OB":431,"[{":432,"\\}\\":433,"\\&=\\":434,"]=\\":435,"]}=":436,"]+[":437,"aj":438,"bc":439,"cd":440,"ce":441,"eV":442,"ec":443,"eq":444,"ff":445,"iff":446,"ja":447,"jb":448,"kl":449,"mE":450,"min":451,"mma":452,"mE_":453,"ned":454,"neq":455,"os":456,"p_":457,"pt":458,"str":459,"tfrac":460,"w_":461,"|}\\":462,"}(\\":463,"})=":464,"}};":465,"}}}{":466,"}}}}}":467,"}}+{{":468,"}\\}":469,"^{+}":470,"alig":471,"gamma":472,")\\\\&=\\":473,",\\!":474,"}}\\,\\":475,"}}\\\\{\\":476,"}^{*}\\":477,"dotso":478,"par":479,"}]{":480,")={\\":481,"OEIS":482,"}}={\\":483,"....":484,"cl_":485,"\\{(":486,"abcd":487,"acc":488,"}}{}":489,"div":490,"}\\\\\\":491,")+(\\":492,"]=[":493,"lie":494,"152":495,"Aut":496,"osp":497,"aligned":498,"OEISA08":499,"')":500,"'\\":501,"')\\":502,"',\\":503,"')=":504,"((\\":505,"))":506,")/":507,")[":508,"){\\":509,"))\\":510,")}=\\":511,"))=":512,"),\\;\\":513,")&=\\":514,"+(-":515,",{":516,"-)":517,"-{{":518,".(":519,"/{\\":520,"00":521,"02":522,"13":523,"18":524,"19":525,"1_":526,"110":527,"23":528,"29":529,"2L":530,"38":531,"427":532,"56":533,"58":534,"67":535,"659":536,"656":537,"729":538,"808":539,"8427":540,"9110":541,"9729":542,"<|":543,"={{":544,"CD":545,"ED":546,"End":547,"GL":548,"ME":549,"MN":550,"MJ_":551,"R_":552,"SO":553,"SU":554,"Sp":555,"Vec":556,"YX":557,"[{\\":558,"\\},":559,"\\}=\\":560,"])":561,"],":562,"]}":563,"]^{":564,"]]=":565,"]]+[":566,"cb":567,"ci":568,"cri":569,"db":570,"ds":571,"e1":572,"e2":573,"e3":574,"ef":575,"ead":576,"efor":577,"econ":578,"eil":579,"ell":580,"hbar":581,"head":582,"iM":583,"im":584,"ist":585,"ji":586,"ki":587,"lo":588,"ldots":589,"lia":590,"lce":591,"mc":592,"mv":593,"mil":594,"n_":595,"nce":596,"ow":597,"oon":598,"ohead":599},"merges":["{ \\","a t","} }","m e","m at","mat h","e r","} \\","o r","n a","^ {","o p","at or","er ator","na me","op erator","operator name","a l","e t","r a","i g","i n","f ra","r m","math rm","p h","m u","et a","l e","g a","b eta","me ga",") \\","ph a","al pha","( \\","= \\","^ {\\","m a","math fra","mathfra k","{ {","n u","r t","o t",", \\","}} \\","- \\","h t","r ig","rig ht","f t","o mega","math b","le ft","R i","l a","o n","d ot","} ^{","e x","g e","fra c","+ \\","a d","e d","e m","i j","Ri em","ig ma","dot s","s u","w ed","x _","} {","wed ge","} (","; \\","t o","t r","} =","mathb b","c o","l on","q rt","s qrt","} ,","ex p","co lon","i me","J _","b la","h o","r ho","na bla","ime s","p a","s igma","} ]","p s","s et","b set","i al","r c","t a","rt ial","su bset","pa rtial","M _","p i","q u","t imes","} =\\","}} (","qu ad","F _","O mega","o v","q quad","} ^{\\","ph i","ov er","( -\\",") =","d e","l rc","n er","} -","}} ^{","or ner","lrc orner",") =\\","* }","P _","a m","} {\\","( {{","b ig","} +","} ,\\","} -\\","}] =","A B","O r","l ta","u s","de lta","Or d",") ^{","O E","f or","g le","l us","n gle","} +\\","op lus","mathb f","ps i","big wedge","U _","\\ }","g _","{ {\\","}} =","}} }\\","al l","for all",". .","C _","N _","i _","l n","} )","ma ps","}^{ *}","su m","maps to","1 0","B _","G am","S igma","[ \\","\\ {\\","c l","c on","i l","r i","t H","t h","} )\\","Gam ma","( {\\","= {\\","A O","C E","H am","\\ {","a b","b d","b mat","c u","c al","e _","s t","} &","}} }","math cal","le q","dots i","con g","ri x","th eta","bmat rix","cu p",", [","2 n","; =","E _","I S","T _","\\ ;\\","a c","c dots","i k","j k","j l","l l","n d","t ex","t st","y le","} /","}} {","^{ *}","ra ngle","la ngle",";\\ ;=","ta u","}]= [","\\;\\ ;\\;=","tst yle","( -",") (",") -",") }}","1 2","< \\","E B","P V","W _","a r","b e","b u","d i","e nd","g in","i a","i i","i ot","j j","m bd","r _","s l","t _","v _","{ (","}} '","}} ^{\\","}\\ \\",",\\ ;\\","la mbd","dots b","}{ }","}= {\\","}= {{","}- {{","ll et","tex tstyle","be gin","bu llet","iot a","lambd a","& =\\","' '","' ,","( [",") +","* }\\","- {\\","0 8","A E","L _","M at","O C","X Y","X _","\\ ,","] =","] \\","a i","b in","b ar","c _","c h","c dot","f _","g l","g al","l i","n ot","o m","{ |","ot imes",",\\ ;","Ri c","ge q","ij k","dots c","}{ }^{","de g","}}= {{","IS O","bin om","ch i",") |",") }",") ^{\\",") }(",") }=",") }{\\","+ [","+ }","+ )\\","+ {{",", +)\\","1 5","2 7","5 9","= (","= -\\","= {{\\","A u","A 08","O B","[ {","\\ }\\","\\ &=\\","] =\\","] }=","] +[","a j","b c","c d","c e","e V","e c","e q","f f","i ff","j a","j b","k l","m E","m in","m ma","m E_","n ed","n eq","o s","p _","p t","s tr","t frac","w _","| }\\","} (\\","} )=","}} ;","}} }{","}} }}}","}} +{{","}\\ }","^{ +}","al ig","ga mma",")\\ \\&=\\",",\\ !","}}\\ ,\\","}}\\ \\{\\","}^{ *}\\","dots o","pa r","}] {",")= {\\","OE IS","}}= {\\",".. ..","cl _","\\{ (","ab cd","ac c","}}{ }","di v","}\\\\ \\",")+ (\\","]= [","li e","15 2","Au t","os p","alig ned","OEIS A08","' )","' \\","' )\\","' ,\\","' )=","( (\\",") )",") /",") [",") {\\",") )\\",") }=\\",") )=",") ,\\;\\",") &=\\","+ (-",", {","- )","- {{",". (","/ {\\","0 0","0 2","1 3","1 8","1 9","1 _","1 10","2 3","2 9","2 L","3 8","4 27","5 6","5 8","6 7","6 59","6 56","7 29","8 08","8 427","9 110","9 729","< |","= {{","C D","E D","E nd","G L","M E","M N","M J_","R _","S O","S U","S p","V ec","Y X","[ {\\","\\ },","\\ }=\\","] )","] ,","] }","] ^{","] ]=","] ]+[","c b","c i","c ri","d b","d s","e 1","e 2","e 3","e f","e ad","e for","e con","e il","e ll","h bar","h ead","i M","i m","i st","j i","k i","l o","l dots","l ia","l ce","m c","m v","m il","n _","n ce","o w","o on","o head"]}}